-- Задача:
--
-- Напишите SQL-запрос, который вернёт количество заказов по каждому пользователю с price_total 
-- больше или равным 1000 в таком виде отсортированному по количеству заказов в обратном порядке:
-- 
-- Дана таблица "orders":
--
-- | id | user_id | created_at | price_total |
-- |----|---------|------------|-------------|
-- | 1  | 111     | 2024-01-01 |    2 000    |
-- | 2  | 222     | 2024-01-02 |      100    |
-- | 3  | 111     | 2024-04-01 |   20 000    |
-- | 4  | 222     | 2024-05-01 |    5 000    |
-- | 5  | 333     | 2024-05-02 |   10 000    |
--
-- Результат запроса:
--
-- | user_id | order_count |
-- |---------|-------------|
-- | 111     | 2           |
-- | 222     | 1           |
-- | 333     | 1           |

-- Решение:
SELECT user_id, count(*) AS order_count
FROM orders
WHERE price_total >= 1000
GROUP BY user_id
ORDER BY order_count DESC